In [ ]:
import pandas as pd

In [ ]:
#from google.colab import drive
#drive.mount('/content/drive')

In [ ]:
df1 = pd.read_excel("/content/drive/MyDrive/datasets/Aracaju.xlsx")
df2 = pd.read_excel("/content/drive/MyDrive/datasets/Fortaleza.xlsx")
df3 = pd.read_excel("/content/drive/MyDrive/datasets/Natal.xlsx")
df4 = pd.read_excel("/content/drive/MyDrive/datasets/Recife.xlsx")
df5 = pd.read_excel("/content/drive/MyDrive/datasets/Salvador.xlsx")

In [ ]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [ ]:
df = pd.concat([df1,df2,df3,df4,df5])

In [ ]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [ ]:
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
109  Salvador 2019-03-02  124.37    1035     1
20    Aracaju 2018-01-01   39.86    1522     9
172     Natal 2019-01-02    6.70    1035     1
106  Salvador 2019-01-01  149.19    1035     2
38    Aracaju 2018-01-01  142.46    1520     1

In [ ]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
df["LojaID"] = df["LojaID"].astype("object")

In [ ]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [ ]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [ ]:
df["Vendas"].mean()

122.61180089485438

In [ ]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
126  Fortaleza 2019-03-02   41.87    980     8
2        Natal 2019-03-11  308.00    852     3
40    Salvador 2019-02-13  161.87   1036     3
99      Recife 2019-01-01  136.72    980     4
70    Salvador 2019-01-01   39.06   1034     3
32   Fortaleza 2019-01-01   43.33   1004     4
150   Salvador 2019-01-02   11.13   1035     2
183   Salvador 2019-01-02  120.23   1037     2
115      Natal 2019-01-02  202.33   1035     2
111   Salvador 2019-03-02  147.35   1037     2
15       Natal 2018-02-01  432.00    854     3
127   Salvador 2019-03-02  240.61   1035     3
52       Natal 2018-04-27  778.00    854     4
213      Natal 2019-01-02   42.12   1035     1
131     Recife 2019-03-02  139.07    982     6

In [ ]:
df["Vendas"].fillna(0, inplace=True)

In [ ]:
df.dropna(inplace=True)

In [ ]:
df.dropna(subset=["Vendas"], inplace=True)

In [ ]:
df.dropna(how="all", inplace=True)

In [ ]:
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [ ]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [ ]:
df["Receita"].max()

3544.0

In [ ]:
df["Receita"].min()

3.34

In [ ]:
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [ ]:
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [ ]:
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [ ]:
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

In [ ]:
df["Data"] = df["Data"].astype("int64")

In [ ]:
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [ ]:
df["Data"] = pd.to_datetime(df["Data"])

In [ ]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [ ]:
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [ ]:
df["Ano_Venda"] = df["Data"].dt.year

In [ ]:
df.sample(5)

       Cidade       Data  Vendas  ...  Receita  Receita/Vendas  Ano_Venda
179     Natal 2019-01-02   64.95  ...    64.95             1.0       2019
43    Aracaju 2018-01-01   19.63  ...   176.67             9.0       2018
220  Salvador 2019-01-02   42.71  ...    42.71             1.0       2019
48      Natal 2018-09-20  676.00  ...  2704.00             4.0       2018
38     Recife 2019-01-01  104.53  ...   418.12             4.0       2019

[5 rows x 8 columns]

In [ ]:
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [ ]:
df.sample(5)

       Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
116    Recife 2019-03-02   79.10  ...      2019          3          2
36     Recife 2019-01-01  146.62  ...      2019          1          1
110  Salvador 2019-03-02  185.93  ...      2019          3          2
86      Natal 2019-01-02  156.47  ...      2019          1          2
155     Natal 2019-01-02  237.81  ...      2019          1          2

[5 rows x 10 columns]

In [ ]:
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [ ]:
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [ ]:
df.sample(5)

       Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
154  Salvador 2019-01-02    9.58  ...         1          2        366 days
105   Aracaju 2018-01-01   24.81  ...         1          1          0 days
50     Recife 2019-01-01    7.24  ...         1          1        365 days
114    Recife 2019-03-02   16.82  ...         3          2        425 days
22     Recife 2019-01-01   39.53  ...         1          1        365 days

[5 rows x 11 columns]

In [ ]:
df["trimestre_venda"] = df["Data"].dt.quarter

In [ ]:
df.sample(5)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
237      Natal 2019-01-03   38.06  ...         3        367 days                1
109  Fortaleza 2019-03-02   18.90  ...         2        425 days                1
112      Natal 2019-01-02   43.00  ...         2        366 days                1
19    Salvador 2019-01-01  167.12  ...         1        365 days                1
65       Natal 2019-04-05  292.00  ...         5        459 days                2

[5 rows x 12 columns]

In [ ]:
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [ ]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
136   Salvador 2019-03-02   13.81  ...         2        425 days                1
139     Recife 2019-03-02  141.16  ...         2        425 days                1
136  Fortaleza 2019-03-02   39.09  ...         2        425 days                1
137  Fortaleza 2019-03-02   51.99  ...         2        425 days                1
32       Natal 2019-03-17  244.00  ...        17        440 days                1
42       Natal 2019-03-02  775.00  ...         2        425 days                1
141  Fortaleza 2019-03-02  182.75  ...         2        425 days                1
121     Recife 2019-03-02   41.55  ...         2        425 days                1
127  Fortaleza 2019-03-02   39.56  ...         2        425 days                1
134   Salvador 2019-03-02  125.90  ...         2        425 days                1
18       Natal 2019-03-14  581.00  ...        14        437 days                1
82       Natal 2019-03-07  868.00  ...         7        430 days                1
126   Salvador 2019-03-02   41.69  ...         2        425 days                1
134     Recife 2019-03-02  195.18  ...         2        425 days                1
129   Salvador 2019-03-02  125.66  ...         2        425 days                1
111   Salvador 2019-03-02  147.35  ...         2        425 days                1
132  Fortaleza 2019-03-02   17.49  ...         2        425 days                1
138  Fortaleza 2019-03-02  150.38  ...         2        425 days                1
127   Salvador 2019-03-02  240.61  ...         2        425 days                1
116   Salvador 2019-03-02   41.78  ...         2        425 days                1

[20 rows x 12 columns]